{"posts":[{"title":"代码高亮测试","text":"123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180181182183184185186187188189190191192193194195196197$(document).ready(function () { alert('RUNOOB');});class Product1{ public: std::vector&lt;std::string&gt; parts_; void ListParts()const{ std::cout &lt;&lt; &quot;Product parts: &quot;; for (size_t i=0;i&lt;parts_.size();i++){ if(parts_[i]== parts_.back()){ std::cout &lt;&lt; parts_[i]; }else{ std::cout &lt;&lt; parts_[i] &lt;&lt; &quot;, &quot;; } } std::cout &lt;&lt; &quot;\\n\\n&quot;; }};/** * The Builder interface specifies methods for creating the different parts of * the Product objects. */class Builder{ public: virtual ~Builder(){} virtual void ProducePartA() const =0; virtual void ProducePartB() const =0; virtual void ProducePartC() const =0;};/** * The Concrete Builder classes follow the Builder interface and provide * specific implementations of the building steps. Your program may have several * variations of Builders, implemented differently. */class ConcreteBuilder1 : public Builder{ private: Product1* product; /** * A fresh builder instance should contain a blank product object, which is * used in further assembly. */ public: ConcreteBuilder1(){ this-&gt;Reset(); } ~ConcreteBuilder1(){ delete product; } void Reset(){ this-&gt;product= new Product1(); } /** * All production steps work with the same product instance. */ void ProducePartA()const override{ this-&gt;product-&gt;parts_.push_back(&quot;PartA1&quot;); } void ProducePartB()const override{ this-&gt;product-&gt;parts_.push_back(&quot;PartB1&quot;); } void ProducePartC()const override{ this-&gt;product-&gt;parts_.push_back(&quot;PartC1&quot;); } /** * Concrete Builders are supposed to provide their own methods for * retrieving results. That's because various types of builders may create * entirely different products that don't follow the same interface. * Therefore, such methods cannot be declared in the base Builder interface * (at least in a statically typed programming language). Note that PHP is a * dynamically typed language and this method CAN be in the base interface. * However, we won't declare it there for the sake of clarity. * * Usually, after returning the end result to the client, a builder instance * is expected to be ready to start producing another product. That's why * it's a usual practice to call the reset method at the end of the * `getProduct` method body. However, this behavior is not mandatory, and * you can make your builders wait for an explicit reset call from the * client code before disposing of the previous result. */ /** * Please be careful here with the memory ownership. Once you call * GetProduct the user of this function is responsable to release this * memory. Here could be a better option to use smart pointers to avoid * memory leaks */ Product1* GetProduct() { Product1* result= this-&gt;product; this-&gt;Reset(); return result; }};/** * The Director is only responsible for executing the building steps in a * particular sequence. It is helpful when producing products according to a * specific order or configuration. Strictly speaking, the Director class is * optional, since the client can control builders directly. */class Director{ /** * @var Builder */ private: Builder* builder; /** * The Director works with any builder instance that the client code passes * to it. This way, the client code may alter the final type of the newly * assembled product. */ public: void set_builder(Builder* builder){ this-&gt;builder=builder; } /** * The Director can construct several product variations using the same * building steps. */ void BuildMinimalViableProduct(){ this-&gt;builder-&gt;ProducePartA(); } void BuildFullFeaturedProduct(){ this-&gt;builder-&gt;ProducePartA(); this-&gt;builder-&gt;ProducePartB(); this-&gt;builder-&gt;ProducePartC(); }};/** * The client code creates a builder object, passes it to the director and then * initiates the construction process. The end result is retrieved from the * builder object. *//** * I used raw pointers for simplicity however you may prefer to use smart * pointers here */void ClientCode(Director&amp; director){ ConcreteBuilder1* builder = new ConcreteBuilder1(); director.set_builder(builder); std::cout &lt;&lt; &quot;Standard basic product:\\n&quot;; director.BuildMinimalViableProduct(); Product1* p= builder-&gt;GetProduct(); p-&gt;ListParts(); delete p; std::cout &lt;&lt; &quot;Standard full featured product:\\n&quot;; director.BuildFullFeaturedProduct(); p= builder-&gt;GetProduct(); p-&gt;ListParts(); delete p; // Remember, the Builder pattern can be used without a Director class. std::cout &lt;&lt; &quot;Custom product:\\n&quot;; builder-&gt;ProducePartA(); builder-&gt;ProducePartC(); p=builder-&gt;GetProduct(); p-&gt;ListParts(); delete p; delete builder;}int main(){ Director* director= new Director(); ClientCode(*director); delete director; return 0; } Output.txt: 执行结果Standard basic product:Product parts: PartA1Standard full featured product:Product parts: PartA1, PartB1, PartC1Custom product:Product parts: PartA1, PartC1","link":"/dai-ma-gao-liang-ce-shi/"},{"title":"关于","text":"Q：为什么要写博客？A：希望自己能够主动的对所学知识进行整理、复盘、归档和输出。 👨🏻‍💻关于我感谢你费心了解我，我是尹正一，毕业于青岛科技大学智能电网信息工程专业，现居于山东省。喜欢与众不同，爱折腾，能享受孤独。不入流的嵌入式开发，希望自己能不断进步。 📬 联系方式Email:yzybab@gmail.com","link":"/about/"},{"title":"电力物联网复习","text":"1、物联网三层体系结构中主要包含哪三层？简述每层内容和作用？ 感知层：利用传感器获得被测量的模拟信号，并负责把模拟信号量转换成数字，包括从电子设备中采集到的直接的数字，并将处理后的数据传递给网络层。 网络层：主要将来自感知层的各类信息通过基础承载网络传输到应用层。 应用层：主要将物联网技术与行业专业系统相结合，实现广泛的物物互联的应用解决方案，主要包括业务中间件和行业应用领域。用于支撑跨行业，跨医用，跨系统之间的信息协同，共享，互通。 2、简述传感器的作用及组成？作用：传感器实际上是一种功能快，其作用是将来自外界的各种信号转换成电信号。组成：敏感元件，转换元件，基本转换电路。 3、简述RFID的定义，组成及其工作原理？定义：又称电子标签，无线射频识别。是自动识别技术的一种，通过无线射频方式进行非接触双向数据通信，利用无线射频方式对记录媒体进行读写，从而达到识别目标和数据交换的目的。组成：标签，阅读器，天线。工作原理：标签进人磁场后，接收解读器发出的射频信号，凭借感应电流所获得的能量发送出存储在芯片中的产品信息，或者由标签主动发送某一频率的信号，解读器读取信息并解码后，送至中央信息系统进行有关数据处理，实现对被识别物体的自动识别。 4、什么是ZigBee，它的特点主要是什么？ZigBee是一种短距离无线通信技术。特点：近距离、低复杂度、自组织、低功耗、低数据速率、低成本，双向传输交互式通信，以接力的方式通过无线电波。 5、什么是WIFI，简述其特点？Wi-Fi是一种可以将个人电脑、手持设备等终端以无线方式互相连接的技术。优点： 无线电波的覆盖范围广 传输的速度非常快 进入该领域的门槛比较低 6、电力物联网建设的目的是什么？ 电网状态全息感知； 运行数据全面连接； 公司业务全面上线； 客户服务全新体验； 能源生态开放共享； 7、什么是中间件？中间件有什么特点？中间件是位于平台和应用之间的具有标准程序接口和协议的通信服务。他们可以有符合接口和协议规范的多种实现来满足不同操作系统和硬件平台需求。特点： 标准的协议和接口。 分布计算，提供网络、硬件和操作系统的透明性。 满足大量的应用需要。 能运行于多种硬件和操作系统平台上。 7、UWB的技术有什么特点？ 传输速率高，空间容量大； 适合短距离通信； 具有良好的共存性和保密性； 多径分辨能力强，定位精度高； 体积小、功耗低； 8、云计算为最终用户带来哪些好处？ 减少了资源的浪费和闲置，降低了用户对软硬件的投入； 资源和软件的集中管理维护，降低了对用户系统维护能力的要求； 使得普通用户能够享受到高端的计算和资源服务，提升了用户的使用体验。 9、简述无线传感器网络的特征。规模大、自组织、多跳路由、动态性、 可靠性、以数据为中心、与应用密切相关等。 10、举例说明我们身边的传感器（五项以上）？电视机、音响、DVD、空调遥控器等所使用的红外线传感器；电冰箱、微波炉、空调及温控所使用的温度传感器；家庭使用的煤气灶、燃气热水器报警所使用的气体传感器；家用摄像机、数码照相机、上网聊天视频所使用的光电传感器；汽车所使用的传感器就更多，如温度、压力、油量、角度线性位移传感器等。","link":"/dian-li-wu-lian-wang-fu-xi/"},{"title":"智能变电站技术","text":"第一章坚强智能电网概念以特高压电网为骨干网架，各种电网协调发展的坚强电网为基础，以信息通信平台为支撑，具有信息化、自动化、互动化特征，包括电力系统发电、输电、变电、配电、用电和调度各个环节，覆盖所有电压等级，实现“电力流、信息流、业务流”的高度一体化融合的现代电网。 智能变电站概念智能变电站以数字化变电站作为技术基础，采用先进可靠集成低碳环保的智能设备，以全站信息数字化、通信网络化、信息共享标准化为基本要求，自动完成信息采集、测量、控制、保护计量和监测等基本功能，并可根据支持电网实时自动控制、智能调节、在线分析决策、协同互动等高级功能。数字化变电站和智能变电站的区别数字化变电站主要关注变电站自动化系统信息的数字化传输及信息建模，侧重于基于IEC61850系列标准实现建模标准化和设备及功能的互操作性。采用电子互感器及合并单元及时实现采样值的数字化传输。数字化变电站主要强调手段，而智能变电站更强调目的。在数字化变电站的基础上，对变电站信息进行深层次综合分析利用，侧重于对一次设备的状态检测和分析诊断，变电站有各种高级功能，能实现对变电站站信息的智能监视、报警、事故处理、联动操作等。 第二章虚拟局域网技术 vlan概念虚拟互联网vlan技术是以交换式网络为基础，把网络上的用户终端划分为多个逻辑工作组，每个工作组就是一个虚拟局域网，同一工作组的成员能够改变物理地址而不必重新配置节点。限制了不同工作组间的二层互访，vlan是为解决以太网的安全性和广播问题提出的协议。 第三章互感器的分类 按原理分类：电磁式互感器和电子式互感器。 按用途和性能特点分类：测量用互感器和保护用互感器。 按测量对象分类：电流互感器、电压互感器和组合互感器。 电子式互感器的基本工作原理电压互感器通常采用电阻分压或电容分压原理实现对电压信号的采集。专用的高压电阻或电容实现对电压信号的高精度和高稳定性采集，采用屏蔽电缆或光纤进行传输。电流互感器采用光隔离绝缘，依靠高压母线磁场自励提供传感工作电源，高压侧的测量保护线圈输出的电信号经过数字采样后通过光纤传至二次设备，高低压间实现了光隔离，永久性解决了绝缘隔离难题。传感器头采用小纳米晶磁芯线圈以及高斯保护线圈，具有测量精度高，保护范围宽，免于维护，工作可靠稳定的特点。 电子式的电压互感器的工作原理晶体介质在没有外加电压作用时是各向同性的，而在外加电压作用下变为各向异性的双轴晶体，从而导致其折射率和通光偏振态发生变化，产生双折射。当一束线偏振光射入处于电场中的电光晶体时，射出的两束双折射光束的相位差与外加电场的强度成正比。所以测量出射出束的相位差就可以得到测量电压差。 有源电子式电流互感器高压侧电流取电方式 利用ct从输电电路上取电能 利用电容分压器从母线上取电能； 蓄电池供能； 激光供能； ct供电+激光供能； 第四章保护第二节 分布式母线保护 定义：分布式母线保护是将传统的集中式母线保护分散成若干个母线保护单元，数量与被保护母线的回路数相同，分散安装在各回路保护屏上，各保护单元通过计算机网络联接起来。 特点：每个保护单元只输入本回路的电流量，转换为数字量后，通过计算机网络传送给其它所有回路的保护单元，各保护单元根据本回路的电流量和从计算机网络上获得的其他所有回路的电流量，进行母线差动保护的计算。如果结果证明是母线内部故障则只跳开本回路断路器，将故障母线隔离，在母线外故障时，各保护单元都计算为外部故障而不动作。 优点：相比传统的集中式母线保护具有较高的可靠性，因为如果一个保护单元收到干扰或计算错误而误动时，只会错误地跳开本回路，而不会造成整个母线被切除的恶行事故。这对于超高压母线的系统枢纽非常重要。 第四节 继电保护的接线方式 110kv，220kv 110kv智能变电站 220kv智能变电站 合并单元是用以对来自二次转换器的电流、电压数据进行时间相关组合的物理单元，分为点对点接口和组网接口(SV网)。合并单元的数字输出接口通常被称为SV、SAV或SMV接口，三者都是采样值（sampled value）的缩写。合并单元采用统一的标准将多个电子式互感器的保护电流、测量电流、测量电压的采样值进行合并采样并输出。 遵循双重化原则，主变压器保护配置双套装置，实现差动、后备保护装置性能一体化。保护跳闸采用点对点直跳的方式。保护装置提供网络接口用以接收高中低压侧的合并单元采样值。站控层设备：主机兼操作员工工作站、远动通信装置、网络通信记录分析系统以及其他智能接口设备。间隔层：和110kv一样过程层：互感器、合并单元、智能终端 第五章 智能变电站一次设备变压器的调压方式无励磁调压和有载调压。无励磁调压是在不施加电压的情况下变化变压器的分接头，变换高压侧分接头来改变绕组匝数进行调压的。有载调压是利用有载分接开关，在不切断负载电流的情况下，变换高压绕组的分接头，来改变高压匝数进行调压的。 第六章重要二次设备三层是什么 站控层设备按功能分为过程层、间隔层和站控层。 过程层设备由合并单元、智能终端和智能组件等组成。 间隔层设备由每个间隔的控制、保护或监视单元组成。 站控层设备有监控主机、数据通信网关机、数据服务器、综合应用服务器、操作员站、工程师工作站、pmu数据集中器和计划管理终端等。设备摆放位置合并单元摆放位置：在开关柜内。智能终端摆放位置：在断路器或变压器附近的控制柜中。断路器智能终端与断路器隔离开关及接地开关等一次开关设备就近安装，完成对一次设备的信息采集和分合控制等功能。智能终端、合并单元过程设备合并单元按照功能可分为间隔合并单元和母线合并单元。间隔合并单元用于线路、变压器和电容器等间隔的电气量采集，母线合并单元一般采集母线电压或同期电压。合并单元采用分布式构架，应用主要功能模块分为输入模块、处理模块、输出模块。 （智能终端对一次设备状态信息就地进行采集，并将信息上传给间隔层设备，间隔层设备发出控制信息，根据收到的控制信息由就地采集信息的设备完成对一次设备的分合闸操作。）","link":"/zhi-neng-bian-dian-zhan-ji-zhu/"},{"title":"智能电表与用户需求管理","text":"第一章什么是电力需求侧管理是什么 意义 要达到什么目标 管理要采取什么措施定义： 电力需求侧管理是指通过提高终端用电效率和优化用电方式，在完成同样用电功能的同时减少电量的消耗和电力需求，达到节约能源和保护环境的目的，是实现低成本电力服务所进行的用电管理活动。意义： 对社会的意义：可以减少对电力的需求，从而减少了一次能源的消耗与污染物的排放，缓解了环境压力，同时减少社会资源的投入和自然资源的消耗。 对政府的意义：可以合理配置电力资源，促进经济协调发展，降低单位GDP能耗。 对供电公司的意义：可以减少高峰时段电力负荷对电网的压力，提高供电的可靠性，保证电网安全经济运行。 对电力用户的意义：可以降低电力消耗，减少开支，降低经营成本，提高竞争力。目标： 清楚用电情况，合理分配用电。 监视、电能计量通过智能型测控仪表来实现。 根据可靠性和高效率配电管理的要求，科学合理的用电。集中在电力和电量的改变上。电力削峰填谷以较少的新增装机容量达到系统的电力供需平衡。电量，采取相关措施节省电力系统的发电量，在满足相同电力服务的同时节约了总资源的消耗。措施： 技术手段：针对管理的具体对象，以及生产工艺和生活习惯的用电特点，采用先进的节电技术和设备来改变用电方式或提高终端用电效率。 经济手段：指根据负荷特性，发挥价格杠杆调节电力供求关系，刺激和鼓励用户改变消费行为和用电方式，减少电量消耗和电力需求。 法律手段：通过政府颁布有关法规条例等来规范电力消费和电力市场行为。 宣传手段：通过宣传引导电力用户合理消费电能，达到节能的目的。 第二章智能电网 不同国家提出智能电网 美国 欧洲 特别是我国和日本 提出智能电网的动因是什么我国提出智能电网的动因： 电网是国家能源产业链的重要环节，是国家综合运输体系的重要组成部分。 随着中国经济社会高速发展，电力需求日益增长，中国电力工业建设进入快速发展时期。 中国能源分布、经济发展不均衡，必须提高电网输送能力，发展远距离、大跨距、大容量输电，加强统一协调和规划建设，形成统一调度运行的统一或联合电网。 各行业对电力的依赖增强，对供电可靠性及电能质量的要求日益提高。日本提出智能电网的动因：能源匮乏，除核电外，能源自给率只有4%，石油依赖度50%。 第三章用电信息采集系统的组成主站、通信信道、通信设备/* 用电信息采集终端：可以实现电能表数据的采集、数据管理、数据双向传输以及转发或执行控制命令的设备。 专变采集终端：可以实现电能表数据的采集、电能计量设备工况和功能电能质量监测，以及客户用电负荷和电能量的监控，并对采集数据进行管理和双向传输。 集中抄表终端：包括集中器、采集器。集中器是指收集各采集器或电能表的数据，并进行处理储存，同时能和主站或手持设备进行数据交换的设备。采集器是用于采集多个或单个电能表的电能信息，并可与集中器交换数据的设备。 分布式能源监控终端：可以实现对双向电能计量设备的信息采集、电能质量监测，并可接受主站命令对分布式能源系统接入公用电网进行控制。*/主站通信信道通信方式 有线无线232 485plc无线GPS蓝牙 每种的特点 根据需要选择设备 远距离通信信道：光纤专网、gprs/cdma无线公网、230Mhz无线专网和中压电力载波等。光纤专网：设备成本高，但维护费用低，可长期使用。高速通信，完全不受电磁干扰和天气影响，可靠性高。gprs/cdma公网：成本低，但运行成本高。速率低，易受地裂、天气的影响，可靠性低。230Mhz无线专网：成本和维护费用低，无线专网运行安全性较高，但受电磁干扰、地形和天气影响大，可靠性差。中压电力线载波：成本和维护费用低，专网运行安全性高，但受电网负载和结构影响大，可靠性差。 本地通信信道：电力线载波、rs-485总线和短距离无线电力线载波：无需布线，可靠性高，维护量小。窄带载波为半双工轮询机制，宽带载波为全双工双向同时通信。rs-485总线：需要布线到电表，可靠性高，维护量大，采用半双工轮询机制。短距离无线：无需布线，安装调试复杂，可靠性差，维护量大，采用半双工轮询机制。第四章 电能计量技术电能计量技术技术组成 电能表是电能计量装置的核心部分，它起着计量负载消耗或电源发出的电能的作用。 在高压电、大电流的系统中，必须通过电压、电流互感器将高电压、大电流变换成低电压、小电流再接入电能表进行测量。电能表二次回路的作用通过导线将电能表和互感器连接，易于工作人员监测。但二次回路会对电能计量装置的准确度产生影响。 第五章 感应式电能表组成和工作原理组成： 由测量机构和辅助部件组成。 测量机构有电压元件和电流元件两个驱动元件。还有转动元件、制动元件、轴承和计度器。 辅助部件有基架、外壳、端钮盒和铭牌。工作原理： 运行中的电能表，其转盘收到电磁力形成的驱动力矩的作用而转动。即转盘是一个导体，在转盘上穿过磁通，导体便有电流通过，在磁场力的作用下收到电磁力所形成的驱动力矩的作用而转动。了解感应式电能表的误差来源和如何减小 了解 第六章电子式电能表组成输入级、乘法器、p/f变换器、计数显示控制电路、直流电源。输入极 高电压大电流降压 采用互感器 分压 电流分压等电子式电能表的采样方式？直接采样：直接采样是通过热稳定性高的电阻分压网络来取得电压信号，而电阻非常小的锰铜片分流器进行电流直接采样互感器采样：采用电压、电流互感器采样 第七章 多功能电能表比较传统电能表有什么改进 在很宽的电流动态范围内具有高精度 低功耗 高可靠性和稳定性（对时间和温度稳定） 电子通信（自动抄表系统，电力网控制） 多费率计费、防窃电、预付费。 设计的灵活性，易于重新配置和升级。 无需硬件改动即可轻松稳定校准。 容易制造、运输和安装。常用的多功能表最大需量表、脉冲电能表、预付费电能表、分时计量电能表学完以后 智能电网通过智能电能表在整个智能电网中的地位和作用地位：智能电表是智能电网的基础。它不仅向电力公司和消费者提供用电量和用电时间的相关信息，而且还会获取市场用电状况，帮助协调用电设备的运行并调整能耗。作用： 精确核算电能费用 科学分配电力资源 强化电力系统管理效果 监督违规操作行为 精准评估配电网络 扩大市场占有率","link":"/zhi-neng-dian-biao-yu-yong-hu-xu-qiu-guan-li/"},{"title":"继电保护复习part1","text":"名词解释继电保护的选择性、速动性、灵敏性、可靠性 选择性：指保护装置动作时，在可能小的区间内将故障从电力系统中断开，最大限度地保证系统中无故障部分仍能继续安全运行 速动性：指尽可能快的切除故障，以减少设备及用户在大短路电流，低电压下运行的时间，降低设备的损坏程度，提高电力系统并列运行的稳定性 灵敏性：指对于其保护范围内发生故障或不正常运行状态的反应能力 可靠性：包括安全性和依赖性，是对继电保护性能的最根本要求 继电保护装置继电保护装置是指反应电力系统中电气设备发生故障或不正常运行状态，并且动作于断路器跳闸或发出信号的一种自动装置。由测量元件，逻辑判断元件，执行输出元件三部分组成 继电特性无论启动还是返回，继电器的动作都是明确干脆的，不可能停留在某一个中间位置 励磁涌流当空载投入变压器或外部故障切除后电压恢复时，会产生量值很大的励磁电流称为励磁涌动 纵联保护将线路一侧电气量信息传到另一侧去，安装于线路两侧的保护对两侧的电气量同时比较，联合工作，在线路两侧形成纵向的联系 电力系统的一次设备、二次设备电能通过的设备称为一次设备二次设备：对一次设备进行监视，测量，控制，保护的设备。 主保护、后备保护主保护：满足系统稳定和设备安全要求，能以最快速度有选择地切除被保护设备和线路的保护。后备保护：当主保护因为各种原因没有动作，在延时很短时间后，另一个保护将启动并动作，将故障回路跳开。这个保护就是后备保护。 阻抗继电器、阻抗继电器的动作特性阻抗继电器：实现故障阻抗距离测量和比较的电路元件。阻抗继电器在复平面内动作区域的形状，称为动作特性。 继电器继电器是一种能自动执行断续控制的部件 最大运行方式系统在该方式下运行时，具有最小的短路阻抗值，发生短路后产生的短路电流最大的一种运行方式。 最小运行方式系统在该方式下运行时，具有最大的短路阻抗值，发生短路后产生的短路电流最小的一种运行方式。 故障环路在电力系统发生故障时，故障电流自流通的通路称为故障环路。 电力系统事故因电力系统设备故障或者人员工作失误，影响电能供应的数量或质量超过规定范围的事件 导引线通信利用敷设在输电线路两端变电所之间的二次电缆传递被保护线路各册信息的通信方式 自动重合闸装置当断路器跳闸后能够自动地将断路器重新合闸的装置 振荡闭锁用来防止系统振荡时保护误动的措施 瓦斯保护当变压器油箱内故障时，在故障电流和故障点的电弧作用下，变压器油和其他绝缘材料会受热分解，产生大量气体，气体排出的多少和速度，与变压器故障的严重程度有关。利用这种气体来实现保护的装置称为瓦斯保护 电力系统电力系统是产生，变换，输送，分配和使用各种电气设备按照一定的技术与经济要求有机组成的一个联合系统 概念电力系统运行控制的目的通过自然的和人工的控制，使电力系统尽快摆脱不正常的状态和故障状态，能够长时间地在正常状态下运行 继电保护的构成部分测量比较元件，逻辑判断元件，执行输出元件 电力系统继电保护的基本任务 自动、迅速、有选择性的将故障元件从电力系统中切除，使故障元件免于继续遭到损坏，保证其他无故障部分迅速恢复正常运行 反应电气设备的不正常运行状态，并根据运行维护条件，而动作于发生信号或跳闸。此时一般不要求快速动作，而是根据对电力系统及其元件的危害程度规定一定的延时，以免短暂的运行波动造成不必要的动作和干扰引起误动。 自动重合闸的优点、缺点 优点：（1）大大提高供电的可靠性，减小线路停电的次数，特别是对单侧电源的单回路尤为显著（2）在高压输电线路上采用重合闸，还可以提高电力系统的并列运行的稳定性，从而提高传输容量（3）对断路器本身由于机构不良或继电保护误动作而引起的误跳闸，也能起纠正的作用 缺点：（1）使电力系统再一次受到故障的冲击，对超高压系统还可以降低并列运行的稳定性（2）使断路器的工作条件变得更加恶劣，因为他要在短时间内，连续切断两次短路电流。 电力系统短路的危害（1）通过短路点的很大短路电流和燃起的电弧，使故障元件损坏（2）短路电流通过非故障元件，由于发热和电动力的作用，会使其的损坏或缩短其使用寿命（3）电力系统中部分地区的电压大大降低，使大量的电力用户的正常工作遭到破坏或产生废品（4）破坏电力系统中各发电厂之间并列运行的稳定性，引起系统震荡，甚至使系统瓦解 电力系统的故障类型现实中把故障类型分为两类。 当故障发生并切除故障后，经过一定延时故障点绝缘强度恢复、故障点消失，若把断开的线路断路器再合上就能恢复正常的供电，则称这种故障是瞬时性故障，架空线路大多数故障是瞬时性的。 如果故障不能自动消失，延时后故障点依然存在，则称这类故障是永久性故障。 继电保护实现的原理寻找电力元件在三种运行状态下的电气量的差异，提取和利用这些可测参量的差异构成不同原理的保护。 工频故障分量方向元件的优点（方向比较式纵联保护）（1）不受负荷状态的影响（2）不受故障点过渡电阻的影响（3）正、反方向短路时，方向性明确（4）无电压死区（5）不受系统振荡影响 变压器的故障类型变压器的故障可分为油箱内和油箱外两种类型油箱外故障，主要是套管和引出线上发生相间短路以及接地短路。油箱内故障包括相间短路、接地短路、匝间短路以及铁芯的烧损。 变压器的不正常运行状态变压器外部相间短路引起的过电流、外部接地短路引起的过电流和中性点过电压、负荷长时间超过额定容量引起的过负荷、风扇故障或漏油等原因引起冷却能力的下降。 变压器装设的保护类型纵差保护、气体保护（轻瓦斯保护、重瓦斯保护）、相间短路后备保护（电流速断保护、过电流保护、低阻抗保护）、过负荷保护、接地保护、温度保护、冷却器故障保护和其它保护 线路纵联保护的分类、特点 纵联保护按原理可分为方向比较式纵联保护和纵联电流差动保护两大类方向比较式纵联保护通过比较线路两端故障功率方向或故障距离来区分区内故障和区外故障，当线路两侧的正方向元件或距离元件都动作时，判断为区内故障，保护立即跳闸；当任意一侧的正方向元件或距离元件不动作时，就判断为区外故障，两侧的保护都不跳闸。纵联电流差动保护通过直接比较线路两端的电流或电流相位来判断是区内故障还是区外故障，在线路两侧电流大小相等，相位相反，其相量和瞬时值之和都等于故障点的故障电流，量值很大，所以通过检测两侧的电流的相量和或瞬时值之和就可以区分区内故障与区外故障。区内故障时无任何延时，立即跳闸；区外故障，可靠闭锁两侧保护，使之均不动作跳闸。2.纵联保护按通道分类可分为：导引线保护，高频（电力载波）保护，微波保护，光纤保护（最常用） 电力系统的几种运行状态及特点： 正常状态：电力系统以足够的电功率满足负荷对电能的需求，各类设备均在规定的长期安全工作限额内，母线电压和频率在允许的误差范围内。 不正常状态：等式约束条件满足，部分不等式约束条件不满足但又不是故障的工作状态。例如频率降低，过电压等。 故障状态：电力系统一次设备在运行过程中由于外力、绝缘老化、过电压、误操作、设计制造缺陷等原因而故障。 方向纵联保护的动作逻辑及流程方向比较式纵联保护通过比较线路两端故障的功率方向或故障距离来区分区内故障与区外故障，当线路两侧的正方向元件或距离元件都动作时，判断为区内故障，保护立即动作跳闸，当任意一侧的正方向元件或距离元件不动作时，就判断为区外故障，两侧的保护都不跳闸。（ppt） 变压器差动保护不平衡电流产生、克服(1) 针对CT变比引起的不平衡电流传统方法:采用中间变流器;微机保护:软件补偿(2)针对CT性能不同引起的稳态不平衡电流选用型号相同、磁化曲线相同的电流互感器;减小二次负载阻抗;增大变比等。(3) 针对CT性能不同引起的暂态不平衡电流在差动回路中接入速饱和中间变流器，抑制非周期分量的传变。(4)针对励磁涌流引起的不平衡电流采用波形特征识别和谐波含量识别的方法加以闭锁。(5)针对其它原因引起的不平衡电流采用定值躲过的方法。 变压器差动保护不平衡电流的影响因素1.变压器两侧组接线方式不同2.变压器、电流互感器的计算变比与实际变比不同3.变压器带负荷调节分接头4.电流互感器传变误差的影响5.变压器励磁涌流6.非周期分量的影响 影响纵联电流差动保护正确动作的相关因素1、电流互感器的误差和不平衡电流2、输电线路的分布电容电流3、通道传输电流数据(模拟量或数字量)的误差4、通道的工作方式和可靠性。 分析重合闸与保护配合（前加速与后加速）的动作逻辑、恢复供电时间、评价 重合闸前加速保护保护第一次动作无选择性，重合闸以后，保护第二次动作切除故障是有选择性的。优点：1）能快速切除瞬时性故障2）可能使瞬时性故障无法发展成永久性故障，提高了重合闸的成功率。3） 能保证发电厂和重要变电所的母线电压在0.6到0.7倍额定电压以上，从而保证厂用电和重要用户的电能质量。4）使用设备少，只需装设一套重合闸装置，简单、经济。缺点：1）断路器工作条件恶劣，动作次数较多2）重合于永久性故障时，故障切除时间可能较长3）如果重合闸装置或断路器拒绝合闸，则将扩大停电范围。特点：前加速保护主要用于35kv以下由发电厂或重要变电所引出的直配线路上，以便快速切除故障，保证母线电压。 重合闸后加速保护每条线路上都配有完善的三段式保护和重合闸装置的前提下，当线路第一次故障时保护有选择性的动作跳闸，然后进行重合闸，如果重合闸于永久性故障，则加速保护动作，瞬间切除故障，而与保护第一次动作是否延时无关。优点：1）第一次是有选择性的切除故障，不会扩大停电范围，特别是在重要的高压电网中，一般不允许保护无选择性的动作而后重合闸来纠正。2）保证了永久性故障的瞬时切除，并仍然是有选择性的。3）与前加速相比，不受网络结构和负荷条件的限制。缺点：1）每一个断路器上都需要装设一套重合闸，与前加速相比较为复杂2）第一次切除故障可能带有延时后加速的配合方式广泛的用于35kv以上的系统以及对重要负荷供电的送电线路上。","link":"/ji-dian-bao-hu-fu-xi-part1/"}],"tags":[{"name":"智能电网信息工程","slug":"智能电网信息工程","link":"/tags/%E6%99%BA%E8%83%BD%E7%94%B5%E7%BD%91%E4%BF%A1%E6%81%AF%E5%B7%A5%E7%A8%8B/"}],"categories":[],"pages":[]}